[
    {
        "cn": "CHAPTER XVI - OF OFFENCES RELATING TO RELIGION",
        "st": "298. Injuring or defiling a place of worship with intent to insult the religion of any class.",
        "s": "298. Whoever destroys, damages or defiles any place of worship, or any object held sacred by any class of persons with the intention of thereby insulting the religion of any class of persons or with the knowledge that any class of persons is likely to consider such destruction, damage or defilement as an insult to their religion, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVI - OF OFFENCES RELATING TO RELIGION",
        "st": "299. Deliberate and malicious acts intended to outrage religious feelings of any class by insulting its religion or religious beliefs.",
        "s": "299. Whoever, with deliberate and malicious intention of outraging the religious feelings of any class of citizens of India, by words, either spoken or written, or by signs or by visible representations or through electronic means or otherwise, insults or attempts to insult the religion or the religious beliefs of that class, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVI - OF OFFENCES RELATING TO RELIGION",
        "st": "300. Disturbing a religious assembly.",
        "s": "300. Whoever voluntarily causes disturbance to any assembly lawfully engaged in the performance of religious worship, or religious ceremonies, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVI - OF OFFENCES RELATING TO RELIGION",
        "st": "301. Trespassing on burial places, etc.",
        "s": "301. Whoever, with the intention of wounding the feelings of any person, or of insulting the religion of any person, or with the knowledge that the feelings of any person are likely to be wounded, or that the religion of any person is likely to be insulted thereby, commits any trespass in any place of worship or on any place of sepulchre, or any place set apart for the performance of funeral rites or as a depository for the remains of the dead, or offers any indignity to any human corpse, or causes disturbance to any persons assembled for the performance of funeral ceremonies, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVI - OF OFFENCES RELATING TO RELIGION",
        "st": "302. Uttering words, etc., with deliberate intent to wound religious feelings of any person.",
        "s": "302. Whoever, with the deliberate intention of wounding the religious feelings of any person, utters any word or makes any sound in the hearing of that person or makes any gesture in the sight of that person or places any object in the sight of that person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both"
    }
]