[
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "227. Giving false evidence.",
        "s": "227. Whoever, being legally bound by an oath or by an express provision of law to state the truth, or being bound by law to make a declaration upon any subject, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, is said to give false evidence.\n\nExplanation 1.—A statement is within the meaning of this section, whether it is made verbally or otherwise.\n\nExplanation 2.—A false statement as to the belief of the person attesting is within the meaning of this section, and a person may be guilty of giving false evidence by stating that he believes a thing which he does not believe, as well as by stating that he knows a thing which he does not know.\n\nIllustrations.\n(a) A, in support of a just claim which B has against Z for one thousand rupees, falsely swears on a trial that he heard Z admit the justice of B’s claim. A has given false evidence.\n\n(b) A, being bound by an oath to state the truth, states that he believes a certain signature to be the handwriting of Z, when he does not believe it to be the handwriting of Z. Here A states that which he knows to be false, and therefore gives false evidence.\n\n(c) A, knowing the general character of Z’s handwriting, states that he believes a certain signature to be the handwriting of Z; A in good faith believing it to be so. Here A’s statement is merely as to his belief, and is true as to his belief, and therefore, although the signature may not be the handwriting of Z, A has not given false evidence.\n\n(d) A, being bound by an oath to state the truth, states that he knows that Z was at a particular place on a particular day, not knowing anything upon the subject. A gives false evidence whether Z was at that place on the day named or not.\n\n(e) A, an interpreter or translator, gives or certifies as a true interpretation or translation of a statement or document which he is bound by oath to interpret or translate truly, that which is not and which he does not believe to be a true interpretation or translation. A has given false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "228. Fabricating false evidence.",
        "s": "228. Whoever causes any circumstance to exist or makes any false entry in any book or record, or electronic record or makes any document or electronic record containing a false statement, intending that such circumstance, false entry or false statement may appear in evidence in a judicial proceeding, or in a proceeding taken by law before a public servant as such, or before an arbitrator, and that such circumstance, false entry or false statement, so appearing in evidence, may cause any person who in such proceeding is to form an opinion upon the evidence, to entertain an erroneous opinion touching any point material to the result of such proceeding is said “to fabricate false evidence”. Illustrations.\n\n(a) A puts jewels into a box belonging to Z, with the intention that they may be found in that box, and that this circumstance may cause Z to be convicted of theft. A has fabricated false evidence.\n\n(b) A makes a false entry in his shop-book for the purpose of using it as corroborative evidence in a Court. A has fabricated false evidence.\n\n(c) A, with the intention of causing Z to be convicted of a criminal conspiracy, writes a letter in imitation of Z’s handwriting, purporting to be addressed to an accomplice in such criminal conspiracy, and puts the letter in a place which he knows that the officers of the police are likely to search. A has fabricated false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "229. Punishment for false evidence.",
        "s": "229. \n(1) Whoever intentionally gives false evidence in any stage of a judicial proceeding, or fabricates false evidence for the purpose of being used in any stage of a judicial proceeding, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine which may extend to ten thousand rupees.\n\n(2) Whoever intentionally gives or fabricates false evidence in any case other than that referred to in sub-section (1), shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine which may extend to five thousand rupees.\n\nExplanation 1.—A trial before a Court-martial is a judicial proceeding.\n\nExplanation 2.—An investigation directed by law preliminary to a proceeding before a Court, is a stage of a judicial proceeding, though that investigation may not take place before a Court.\n\nIllustration.\nA, in an enquiry before a Magistrate for the purpose of ascertaining whether Z ought to be committed for trial, makes on oath a statement which he knows to be false. As this enquiry is a stage of a judicial proceeding, A has given false evidence.\n\nExplanation 3.—An investigation directed by a Court according to law, and conducted under the authority of a Court, is a stage of a judicial proceeding, though that investigation may not take place before a Court.\n\nIllustration.\nA, in an enquiry before an officer deputed by a Court to ascertain on the spot the boundaries of land, makes on oath a statement which he knows to be false. As this enquiry is a stage of a judicial proceeding, A has given false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "230. Giving or fabricating false evidence with intent to procure conviction of capital offence.",
        "s": "230. \n(1) Whoever gives or fabricates false evidence, intending thereby to cause, or knowing it to be likely that he will thereby cause, any person to be convicted of an offence which is capital by the law for the time being in force in India shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine which may extend to fifty thousand rupees.\n\n(2) If an innocent person be convicted and executed in consequence of false evidence referred to in sub-section (1), the person who gives such false evidence shall be punished either with death or the punishment specified in sub-section (1)."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "231. Giving or fabricating false evidence with intent to procure conviction of offence punishable with imprisonment for life or imprisonment.",
        "s": "231. Whoever gives or fabricates false evidence intending thereby to cause, or knowing it to be likely that he will thereby cause, any person to be convicted of an offence which by the law for the time being in force in India is not capital, but punishable with imprisonment for life, or imprisonment for a term of seven years or upwards, shall be punished as a person convicted of that offence would be liable to be punished.\n\nIllustration.\nA gives false evidence before a Court, intending thereby to cause Z to be convicted of a dacoity. The punishment of dacoity is imprisonment for life, or rigorous imprisonment for a term which may extend to ten years, with or without fine. A, therefore, is liable to imprisonment for life or imprisonment, with or without fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "232. Threatening any person to give false evidence.",
        "s": "232. (1) Whoever threatens another with any injury to his person, reputation or property or to the person or reputation of any one in whom that person is interested, with intent to cause that person to give false evidence shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.\n\n(2) If innocent person is convicted and sentenced in consequence of false evidence referred to in sub-section (1), with death or imprisonment for more than seven years, the person who threatens shall be punished with the same punishment and sentence in the same manner and to the same extent such innocent person is punished and sentenced."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "233. Using evidence known to be false.",
        "s": "233. Whoever corruptly uses or attempts to use as true or genuine evidence any evidence which he knows to be false or fabricated, shall be punished in the same manner as if he gave or fabricated false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "234. Issuing or signing a false certificate.",
        "s": "234. Whoever issues or signs any certificate required by law to be given or signed, or relating to any fact of which such certificate is by law admissible in evidence, knowing or believing that such certificate is false in any material point, shall be punished in the same manner as if he gave false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "235. Using as true a certificate known to be false.",
        "s": "235. Whoever corruptly uses or attempts to use any such certificate as a true certificate, knowing the same to be false in any material point, shall be punished in the same manner as if he gave false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "236. False statement made in a declaration which is by law receivable as evidence.",
        "s": "236. Whoever, in any declaration made or subscribed by him, which declaration any Court or any public servant or other person, is bound or authorised by law to receive as evidence of any fact, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, touching any point material to the object for which the declaration is made or used, shall be punished in the same manner as if he gave false evidence."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "237. Using as true such a declaration knowing it to be false.",
        "s": "237. Whoever corruptly uses or attempts to use as true any such declaration, knowing the same to be false in any material point, shall be punished in the same manner as if he gave false evidence.\n\nExplanation.—A declaration which is inadmissible merely upon the ground of some informality, is a declaration within the meaning of section 236 and this section."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "238. Causing disappearance of evidence of an offence, or giving false information to screen an offender.",
        "s": "238. Whoever, knowing or having reason to believe that an offence has been committed, causes any evidence of the commission of that offence to disappear, with the intention of screening the offender from legal punishment, or with that intention gives any information respecting the offence which he knows or believes to be false shall,—\n\n(a) if the offence which he knows or believes to have been committed is punishable with death, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;\n\n(b) if the offence is punishable with imprisonment for life, or with imprisonment which may extend to ten years, be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;\n\n(c) if the offence is punishable with imprisonment for any term not extending to ten years, be punished with imprisonment of the description provided for the offence, for a term which may extend to one-fourth part of the longest term of the imprisonment provided for the offence, or with fine, or with both.\n\nIllustration.\nA, knowing that B has murdered Z, assists B to hide the body with the intention of screening B from punishment. A is liable to imprisonment of either description for seven years, and also to fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "239. Intentional omission to give information of an offence by a person bound to inform.",
        "s": "239. Whoever, knowing or having reason to believe that an offence has been committed, intentionally omits to give any information respecting that offence which he is legally bound to give, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "240. Giving false information respecting an offence committed.",
        "s": "240. Whoever, knowing or having reason to believe that an offence has been committed, gives any information respecting that offence which he knows or believes to be false, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\nExplanation.—In sections 238 and 239 and in this section the word “offence” includes any act committed at any place out of India, which, if committed in India, would be punishable under any of the following sections, namely, 103, 105, 307, sub-sections (2), (3) and (4) of section 309, sub-sections (2), (3), (4) and (5) of section 310, 311, 312, clauses (f) and (g) of section 326, sub-sections (4), (6), (7) and (8) of section 331, clauses (a) and (b) of section 332."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "241. Destruction of a document or electronic record to prevent its production as evidence.",
        "s": "241. Whoever secretes or destroys any document or electronic record which he may be lawfully compelled to produce as evidence in a Court or in any proceeding lawfully held before a public servant, as such, or obliterates or renders illegible the whole or any part of such document or electronic record with the intention of preventing the same from being produced or used as evidence before such Court or public servant as aforesaid, or after he shall have been lawfully summoned or required to produce the same for that purpose, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "242. False personation for the purpose of an act or proceeding in a suit or prosecution.",
        "s": "242. Whoever falsely personates another, and in such assumed character makes any admission or statement, or confesses judgment, or causes any process to be issued or becomes bail or security, or does any other act in any suit or criminal prosecution, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "243. Fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution.",
        "s": "243. Whoever fraudulently removes, conceals, transfers or delivers to any person any property or any interest therein, intending thereby to prevent that property or interest therein from being taken as a forfeiture or in satisfaction of a fine, under a sentence which has been pronounced, or which he knows to be likely to be pronounced, by a Court or other competent authority, or from being taken in execution of a decree or order which has been made, or which he knows to be likely to be made by a Court in a civil suit, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "244. Fraudulent claim to property to prevent its seizure as forfeited or in execution.",
        "s": "244. Whoever fraudulently accepts, receives or claims any property or any interest therein, knowing that he has no right or rightful claim to such property or interest, or practises any deception touching any right to any property or any interest therein, intending thereby to prevent that property or interest therein from being taken as a forfeiture or in satisfaction of a fine, under a sentence which has been pronounced, or which he knows to be likely to be pronounced by a Court or other competent authority, or from being taken in execution of a decree or order which has been made, or which he knows to be likely to be made by a Court in a civil suit, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "245. Fraudulently suffering a decree for a sum not due.",
        "s": "245. Whoever fraudulently causes or suffers a decree or order to be passed against him at the suit of any person for a sum not due or for a larger sum than is due to such person or for any property or interest in property to which such person is not entitled, or fraudulently causes or suffers a decree or order to be executed against him after it has been satisfied, or for anything in respect of which it has been satisfied, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\nIllustration.\nA institutes a suit against Z. Z, knowing that A is likely to obtain a decree against him, fraudulently suffers a judgment to pass against him for a larger amount at the suit of B, who has no just claim against him, in order that B, either on his own account or for the benefit of Z, may share in the proceeds of any sale of Z’s property which may be made under A’s decree. Z has committed an offence under this section."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "246. Dishonestly making a false claim in Court.",
        "s": "246. Whoever fraudulently or dishonestly, or with intent to injure or annoy any person, makes in a Court any claim which he knows to be false, shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "247. Fraudulently obtaining a decree for a sum not due.",
        "s": "247. Whoever fraudulently obtains a decree or order against any person for a sum not due, or for a larger sum than is due or for any property or interest in property to which he is not entitled, or fraudulently causes a decree or order to be executed against any person after it has been satisfied or for anything in respect of which it has been satisfied, or fraudulently suffers or permits any such act to be done in his name, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "248. False charge of an offence made with intent to injure.",
        "s": "248. Whoever, with intent to cause injury to any person, institutes or causes to be instituted any criminal proceeding against that person, or falsely charges any person with having committed an offence, knowing that there is no just or lawful ground for such proceeding or charge against that person,—\n\n(a) shall be punished with imprisonment of either description for a term which may extend to five years, or with fine which may extend to two lakh rupees, or with both;\n\n(b) if such criminal proceeding be instituted on a false charge of an offence punishable with death, imprisonment for life, or imprisonment for ten years or upwards, shall be punishable with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "249. Harbouring an offender.",
        "s": "249. Whenever an offence has been committed, whoever harbours or conceals a person whom he knows or has reason to believe to be the offender, with the intention of screening him from legal punishment shall,—\n\n(a) if the offence is punishable with death, be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine;\n\n(b) if the offence is punishable with imprisonment for life, or with imprisonment which may extend to ten years, be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;\n\n(c) if the offence is punishable with imprisonment which may extend to one year, and not to ten years, be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of imprisonment provided for the offence, or with fine, or with both.\n\nExplanation.––“Offence” in this section includes any act committed at any place out of India, which, if committed in India, would be punishable under any of the following sections, namely 103, 105, 307, sub-sections (2), (3) and (4) of section 309, sub-sections (2), (3), (4) and (5) of section 310, 311, 312, clauses (f) and (g) of section 326, sub-sections (4), (6), (7) and (8) of section 331, clauses (a) and (b) of section 332 and every such act shall, for the purposes of this section, be deemed to be punishable as if the accused person had been guilty of it in India.\nException.—This section shall not extend to any case in which the harbour or concealment is by the spouse of the offender.\n\nIllustration.\nA, knowing that B has committed dacoity, knowingly conceals B in order to screen him from legal punishment. Here, as B is liable to imprisonment for life, A is liable to imprisonment of either description for a term not exceeding three years, and is also liable to fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "250. Taking a gift, etc., to screen an offender from punishment.",
        "s": "250. Whoever accepts or attempts to obtain, or agrees to accept, any gratification for himself or any other person, or any restitution of property to himself or any other person, in consideration of his concealing an offence or of his screening any person from legal punishment for any offence, or of his not proceeding against any person for the purpose of bringing him to legal punishment shall,––\n\n(a) if the offence is punishable with death, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;\n\n(b) if the offence is punishable with imprisonment for life, or with imprisonment which may extend to ten years, be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;\n\n(c) if the offence is punishable with imprisonment not extending to ten years, be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of imprisonment provided for the offence, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "251. Offering a gift or restoration of property in consideration of screening an offender.",
        "s": "251. Whoever gives or causes, or offers or agrees to give or cause, any gratification to any person, or restores or causes the restoration of any property to any person, in consideration of that person’s concealing an offence, or of his screening any person from legal punishment for any offence, or of his not proceeding against any person for the purpose of bringing him to legal punishment shall,––\n\n(a) if the offence is punishable with death, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;\n\n(b) if the offence is punishable with imprisonment for life or with imprisonment which may extend to ten years, be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;\n\n(c) if the offence is punishable with imprisonment not extending to ten years, be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of imprisonment provided for the offence, or with fine, or with both.\n\nException.—The provisions of this section and section 250 do not extend to any case in which the offence may lawfully be compounded."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "252. Taking a gift to help to recover stolen property, etc.",
        "s": "252. Whoever takes or agrees or consents to take any gratification under pretence or on account of helping any person to recover any movable property of which he shall have been deprived by any offence punishable under this Sanhita, shall, unless he uses all means in his power to cause the offender to be apprehended and convicted of the offence, be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "253. Harbouring an offender who has escaped from custody or whose apprehension has been ordered.",
        "s": "253. Whenever any person convicted of or charged with an offence, being in lawful custody for that offence, escapes from such custody, or whenever a public servant, in the exercise of the lawful powers of such public servant, orders a certain person to be apprehended for an offence, whoever, knowing of such escape or order for apprehension, harbours or conceals that person with the intention of preventing him from being apprehended, shall be punished in the manner following, namely:––\n\n(a) if the offence for which the person was in custody or is ordered to be apprehended is punishable with death, he shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;\n\n(b) if the offence is punishable with imprisonment for life or imprisonment for ten years, he shall be punished with imprisonment of either description for a term which may extend to three years, with or without fine;\n\n(c) if the offence is punishable with imprisonment which may extend to one year and not to ten years, he shall be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of the imprisonment provided for such offence, or with fine, or with both.\n\nExplanation.––“Offence” in this section includes also any act or omission of which a person is alleged to have been guilty out of India, which, if he had been guilty of it in India, would have been punishable as an offence, and for which he is, under any law relating to extradition, or otherwise, liable to be apprehended or detained in custody in India, and every such act or omission shall, for the purposes of this section, be deemed to be punishable as if the accused person had been guilty of it in India.\n\nException.—The provisions of this section do not extend to the case in which the harbour or concealment is by the spouse of the person to be apprehended."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "254. Penalty for harbouring robbers or dacoits.",
        "s": "254. Whoever, knowing or having reason to believe that any persons are about to commit or have recently committed robbery or dacoity, harbours them or any of them, with the intention of facilitating the commission of such robbery or dacoity, or of screening them or any of them from punishment, shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.\n\nExplanation.—For the purposes of this section it is immaterial whether the robbery or dacoity is intended to be committed, or has been committed, within or without India.\n\nException.—The provisions of this section do not extend to the case in which the harbour is by the spouse of the offender."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "255. Public servant disobeying direction of law with intent to save a person from punishment or property from forfeiture.",
        "s": "255. Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending thereby to save, or knowing it to be likely that he will thereby save, any person from legal punishment, or subject him to a less punishment than that to which he is liable, or with intent to save, or knowing that he is likely thereby to save, any property from forfeiture or any charge to which it is liable by law, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "256. Public servant framing an incorrect record or writing with intent to save a person from punishment or property from forfeiture.",
        "s": "256. Whoever, being a public servant, and being as such public servant, charged with the preparation of any record or other writing, frames that record or writing in a manner which he knows to be incorrect, with intent to cause, or knowing it to be likely that he will thereby cause, loss or injury to the public or to any person, or with intent thereby to save, or knowing it to be likely that he will thereby save, any person from legal punishment, or with intent to save, or knowing that he is likely thereby to save, any property from forfeiture or other charge to which it is liable by law, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "257. Public servant in judicial proceeding corruptly making a report, etc., contrary to law.",
        "s": "257. Whoever, being a public servant, corruptly or maliciously makes or pronounces in any stage of a judicial proceeding, any report, order, verdict, or decision which he knows to be contrary to law, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "258. Commitment for trial or confinement by a person having authority who knows that he is acting contrary to law.",
        "s": "258. Whoever, being in any office which gives him legal authority to commit persons for trial or to confinement, or to keep persons in confinement, corruptly or maliciously commits any person for trial or to confinement, or keeps any person in confinement, in the exercise of that authority knowing that in so doing he is acting contrary to law, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "259. Intentional omission to apprehend on the part of a public servant bound to apprehend.",
        "s": "259. Whoever, being a public servant, legally bound as such public servant to apprehend or to keep in confinement any person charged with or liable to be apprehended for an offence, intentionally omits to apprehend such person, or intentionally suffers such person to escape, or intentionally aids such person in escaping or attempting to escape from such confinement, shall be punished,––\n\n(a) with imprisonment of either description for a term which may extend to seven years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with death; or\n\n(b) with imprisonment of either description for a term which may extend to three years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with imprisonment for life or imprisonment for a term which may extend to ten years; or\n\n(c) with imprisonment of either description for a term which may extend to two years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with imprisonment for a term less than ten years."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "260. Intentional omission to apprehend on the part of a public servant bound to apprehend a person under sentence or lawfully committed.",
        "s": "260. Whoever, being a public servant, legally bound as such public servant to apprehend or to keep in confinement any person under sentence of a Court for any offence or lawfully committed to custody, intentionally omits to apprehend such person, or intentionally suffers such person to escape or intentionally aids such person in escaping or attempting to escape from such confinement, shall be punished,—\n\n(a) with imprisonment for life or with imprisonment of either description for a term which may extend to fourteen years, with or without fine, if the person in confinement, or who ought to have been apprehended, is under sentence of death; or\n\n(b) with imprisonment of either description for a term which may extend to seven years, with or without fine, if the person in confinement or who ought to have been apprehended, is subject, by a sentence of a Court, or by virtue of a commutation of such sentence, to imprisonment for life or imprisonment for a term of ten years, or upwards; or\n\n(c) with imprisonment of either description for a term which may extend to three years, or with fine, or with both, if the person in confinement or who ought to have been apprehended, is subject by a sentence of a Court to imprisonment for a term not extending to ten years or if the person was lawfully committed to custody."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "261. Escape from confinement or custody negligently suffered by a public servant.",
        "s": "261. Whoever, being a public servant legally bound as such public servant to keep in confinement any person charged with or convicted of any offence or lawfully committed to custody, negligently suffers such person to escape from confinement, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "262. Resistance or obstruction by a person to his lawful apprehension.",
        "s": "262. Whoever intentionally offers any resistance or illegal obstruction to the lawful apprehension of himself for any offence with which he is charged or of which he has been convicted, or escapes or attempts to escape from any custody in which he is lawfully detained for any such offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nExplanation.—The punishment in this section is in addition to the punishment for which the person to be apprehended or detained in custody was liable for the offence with which he was charged, or of which he was convicted."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "263. Resistance or obstruction to lawful apprehension of another person.",
        "s": "263. Whoever, intentionally offers any resistance or illegal obstruction to the lawful apprehension of any other person for an offence, or rescues or attempts to rescue any other person from any custody in which that person is lawfully detained for an offence,—\n\n(a) shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both; or\n\n(b) if the person to be apprehended, or the person rescued or attempted to be rescued, is charged with or liable to be apprehended for an offence punishable with imprisonment for life or imprisonment for a term which may extend to ten years, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine; or\n\n(c) if the person to be apprehended or rescued, or attempted to be rescued, is charged with or liable to be apprehended for an offence punishable with death, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine; or\n\n(d) if the person to be apprehended or rescued, or attempted to be rescued, is liable under the sentence of a Court or by virtue of a commutation of such a sentence, to imprisonment for life, or imprisonment for a term of ten years or upwards, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine; or\n\n(e) if the person to be apprehended or rescued, or attempted to be rescued, is under sentence of death, shall be punished with imprisonment for life or imprisonment of either description for a term not exceeding ten years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "264. Omission to apprehend, or sufferance of escape, on the part of a public servant, in cases not otherwise provided for.",
        "s": "264. Whoever, being a public servant legally bound as such public servant to apprehend, or to keep in confinement, any person in any case not provided for in section 259, section 260 or section 261, or in any other law for the time being in force, omits to apprehend that person or suffers him to escape from confinement, shall be punished—\n\n(a) if he does so intentionally, with imprisonment of either description for a term which may extend to three years, or with fine, or with both; and\n\n(b) if he does so negligently, with simple imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "265. Resistance or obstruction to lawful apprehension or escape or rescue in cases not otherwise provided for.",
        "s": "265. Whoever, in any case not provided for in section 262 or section 263 or in any other law for the time being in force, intentionally offers any resistance or illegal obstruction to the lawful apprehension of himself or of any other person, or escapes or attempts to escape from any custody in which he is lawfully detained, or rescues or attempts to rescue any other person from any custody in which that person is lawfully detained, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "266. Violation of the condition of remission of punishment.",
        "s": "266. Whoever, having accepted any conditional remission of punishment, knowingly violates any condition on which such remission was granted, shall be punished with the punishment to which he was originally sentenced, if he has already suffered no part of that punishment, and if he has suffered any part of that punishment, then with so much of that punishment as he has not already suffered."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "267. Intentional insult or interruption to a public servant sitting in a judicial proceeding.",
        "s": "267. Whoever, intentionally offers any insult, or causes any interruption to any public servant, while such public servant is sitting in any stage of a judicial proceeding, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "268. Personation of an assessor.",
        "s": "268. Whoever, by personation or otherwise, shall intentionally cause, or knowingly suffer himself to be returned, empanelled or sworn as an assessor in any case in which he knows that he is not entitled by law to be so returned, empanelled or sworn, or knowing himself to have been so returned, empanelled or sworn contrary to law, shall voluntarily serve as such assessor, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIV - OF FALSE EVIDENCE AND OFFENCES AGAINST PUBLIC JUSTICE",
        "st": "269. Failure by a person released on a bail bond or bond to appear in Court.",
        "s": "269. Whoever, having been charged with an offence and released on bail bond or on bond, fails without sufficient cause (the burden of proving which shall lie upon him), to appear in Court in accordance with the terms of the bail or bond, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.\n\nExplanation.—The punishment under this section is—\n\n(a) in addition to the punishment to which the offender would be liable on a conviction for the offence with which he has been charged; and\n\n(b) without prejudice to the power of the Court to order forfeiture of the bond"
    }
]