[
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "335. Making a false document.",
        "s": "335. A person is said to make a false document or false electronic record—\n(A) Who dishonestly or fraudulently—\n(i) makes, signs, seals or executes a document or part of a document;\n(ii) makes or transmits any electronic record or part of any electronic record;\n(iii) affixes any electronic signature on any electronic record;\n(iv) makes any mark denoting the execution of a document or the authenticity of the electronic signature, with the intention of causing it to be believed that such document or part of document, electronic record or electronic signature was made, signed, sealed, executed, transmitted or affixed by or by the authority of a person by whom or by whose authority he knows that it was not made, signed, sealed, executed or affixed; or\n\n(B) Who without lawful authority, dishonestly or fraudulently, by cancellation or otherwise, alters a document or an electronic record in any material part thereof, after it has been made, executed or affixed with electronic signature either by himself or by any other person, whether such person be living or dead at the time of such alteration; or\n\n(C) Who dishonestly or fraudulently causes any person to sign, seal, execute or alter a document or an electronic record or to affix his electronic signature on any electronic record knowing that such person by reason of unsoundness of mind or intoxication cannot, or that by reason of deception practised upon him, he does not know the contents of the document or electronic record or the nature of the alteration.\n\nIllustrations.\n(a) A has a letter of credit upon B for rupees 10,000, written by Z. A, in order to defraud B, adds cipher to the 10,000, and makes the sum 1,00,000 intending that it may be believed byB that Z so wrote the letter. A has committed forgery.\n(b) A, without Z’s authority, affixes Z’s seal to a document purporting to be a conveyance of an estate from Z to A, with the intention of selling the estate to B and thereby of obtaining from B the purchase-money. A has committed forgery.\n(c) A picks up a cheque on a banker signed by B, payable to bearer, but without any sum having been inserted in the cheque. A fraudulently fills up the cheque by inserting the sum of ten thousand rupees. A commits forgery.\n(d) A leaves with B, his agent, a cheque on a banker, signed by A, without inserting the sum payable and authorises B to fill up the cheque by inserting a sum not exceeding ten thousand rupees for the purpose of making certain payments. B fraudulently fills up the cheque by inserting the sum of twenty thousand rupees. B commits forgery.\n(e) A draws a bill of exchange on himself in the name of B without B’s authority, intending to discount it as a genuine bill with a banker and intending to take up the bill on its maturity. Here, as A draws the bill with intent to deceive the banker by leading him to suppose that he had the security of B, and thereby to discount the bill, A is guilty of forgery.\n(f) Z’s will contains these words—“I direct that all my remaining property be equally divided between A, B and C.” A dishonestly scratches out B’s name, intending that it may bebelieved that the whole was left to himself and C. A has committed forgery.\n(g) A endorses a Government promissory note and makes it payable to Z or his order by writing on the bill the words “Pay to Z or his order” and signing the endorsement. B dishonestly erases the words “Pay to Z or his order”, and thereby converts the special endorsement into a blank endorsement. B commits forgery.\n(h) A sells and conveys an estate to Z. A afterwards, in order to defraud Z of his estate, executes a conveyance of the same estate to B, dated six months earlier than the date of the conveyance to Z, intending it to be believed that he had conveyed the estate to B before heconveyed it to Z. A has committed forgery.\n(i) Z dictates his will to A. A intentionally writes down a different legatee from the legatee named by Z, and by representing to Z that he has prepared the will according to his instructions, induces Z to sign the will. A has committed forgery.\n(j) A writes a letter and signs it with B’s name without B’s authority, certifying that A is a man of good character and in distressed circumstances from unforeseen misfortune, intending by means of such letter to obtain alms from Z and other persons. Here, as A made a false document in order to induce Z to part with property, A has committed forgery.\n(k) A without B’s authority writes a letter and signs it in B’s name certifying to A’s character, intending thereby to obtain employment under Z. A has committed forgery in as much as he intended to deceive Z by the forged certificate, and thereby to induce Z to enterExplanation 1.—A man’s signature of his own name may amount to forgery.\n\nIllustrations.\n(a) A signs his own name to a bill of exchange, intending that it may be believed that the bill was drawn by another person of the same name. A has committed forgery.\n(b) A writes the word “accepted” on a piece of paper and signs it with Z’s name, in order that B may afterwards write on the paper a bill of exchange drawn by B upon Z, and negotiate the bill as though it had been accepted by Z. A is guilty of forgery; and if B, knowing the fact, draws the bill upon the paper pursuant to A’s intention, B is also guilty offorgery.\n(c) A picks up a bill of exchange payable to the order of a different person of the same name. A endorses the bill in his own name, intending to cause it to be believed that it was endorsed by the person to whose order it was payable; here A has committed forgery.\n(d) A purchases an estate sold under execution of a decree against B. B, after the seizure of the estate, in collusion with Z, executes a lease of the estate, to Z at a nominal rent and for a long period and dates the lease six months prior to the seizure, with intent to defraud A, and to cause it to be believed that the lease was granted before the seizure. B, though he executes the lease in his own name, commits forgery by antedating it.\n(e) A, a trader, in anticipation of insolvency, lodges effects with B for A’s benefit, and with intent to defraud his creditors; and in order to give a colour to the transaction, writes a promissory note binding himself to pay to B a sum for value received, and antedates the note, intending that it may be believed to have been made before A was on the point of insolvency. A has committed forgery under the first head of the definition.\n\nExplanation 2.—The making of a false document in the name of a fictitious person, intending it to be believed that the document was made by a real person, or in the name of a \n\nIllustration.\nA draws a bill of exchange upon a fictitious person, and fraudulently accepts the bill in the name of such fictitious person with intent to negotiate it. A commits forgery.\n\nExplanation 3.—For the purposes of this section, the expression “affixing electronic signature” shall have the meaning assigned to it in clause (d) of sub-section (1) of section 2 of the Information Technology Act, 2000."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "336. Forgery.",
        "s": "336. \n(1) Whoever makes any false document or false electronic record or part of a document or electronic record, with intent to cause damage or injury, to the public or to any person, or to support any claim or title, or to cause any person to part with property, or to enter into any express or implied contract, or with intent to commit fraud or that fraud may be committed, commits forgery.\n\n(2) Whoever commits forgery shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n(3) Whoever commits forgery, intending that the document or electronic record forged shall be used for the purpose of cheating, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\n\n(4) Whoever commits forgery, intending that the document or electronic record forged shall harm the reputation of any party, or knowing that it is likely to be used for that purpose, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "337. Forgery of the record of a Court or of a public register, etc.",
        "s": "337. Whoever forges a document or an electronic record, purporting to be a record or proceeding of or in a Court or an identity document issued by Government including voter     \n\nExplanation.—For the purposes of this section, “register” includes any list, data or record of any entries maintained in the electronic form as defined in clause (r) of sub-section (1) of section 2 of the Information Technology Act, 2000."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "338. Forgery of a valuable security, will, etc.",
        "s": "338. Whoever forges a document which purports to be a valuable security or a will, or an authority to adopt a son, or which purports to give authority to any person to make or transfer any valuable security, or to receive the principal, interest or dividends thereon, or to receive or deliver any money, movable property, or valuable security, or any document purporting to be an acquittance or receipt acknowledging the payment of money, or an acquittance or receipt for the delivery of any movable property or valuable security, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "339. Having possession of a document described in section 337 or section 338, knowing it to be forged and intending to use it as genuine.",
        "s": "339. Whoever has in his possession any document or electronic record, knowing the same to be forged and intending that the same shall fraudulently or dishonestly be used as genuine, shall, if the document or electronic record is one of the description mentioned in section 337 of this Sanhita, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine; and if the document is one of the description mentioned in section 338, shall be punished with imprisonment for life, or with imprisonment of either description, for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "340. Forged document or electronic record and using it as genuine.",
        "s": "340. \n(1) A false document or electronic record made wholly or in part by forgery is designated a forged document or electronic record.\n\n(2) Whoever fraudulently or dishonestly uses as genuine any document or electronic record which he knows or has reason to believe to be a forged document or electronic record, shall be punished in the same manner as if he had forged such document or electronic record."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "341. Making or possessing a counterfeit seal, etc., with intent to commit forgery punishable under section 338.",
        "s": "341. (1) Whoever makes or counterfeits any seal, plate or other instrument for making an impression, intending that the same shall be used for the purpose of committing any forgery which would be punishable under section 338 of this Sanhita, or, with such intent, has in his possession any such seal, plate or other instrument, knowing the same to be counterfeit, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\n\n(2) Whoever makes or counterfeits any seal, plate or other instrument for making an impression, intending that the same shall be used for the purpose of committing any forgery which would be punishable under any section of this Chapter other than section 338, or, with such intent, has in his possession any such seal, plate or other instrument, knowing the same to be counterfeit, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\n\n(3) Whoever possesses any seal, plate or other instrument knowing the same to be counterfeit, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.\n\n(4) Whoever fraudulently or dishonestly uses as genuine any seal, plate or other instrument knowing or having reason to believe the same to be counterfeit, shall be punished in the same manner as if he had made or counterfeited such seal, plate or other instrument."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "342. Counterfeiting a device or mark used for authenticating documents described in section 338, or possessing counterfeit marked material.",
        "s": "342. \n(1) Whoever counterfeits upon, or in the substance of, any material, any device or mark used for the purpose of authenticating any document described in section 338, intending that such device or mark shall be used for the purpose of giving the appearance of authenticity to any document then forged or thereafter to be forged on such material, or who, with such intent, has in his possession any material upon or in the substance of which any such device or mark has been counterfeited, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\n\n(2) Whoever counterfeits upon, or in the substance of, any material, any device or mark used for the purpose of authenticating any document or electronic record other than the documents described in section 338, intending that such device or mark shall be used for the purpose of giving the appearance of authenticity to any document then forged or thereafter to be forged on such material, or who with such intent, has in his possession any material upon or in the substance of which any such device or mark has been counterfeited, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "343. Fraudulent cancellation, destruction, etc., of a will, authority to adopt, or valuable security.",
        "s": "343. Whoever fraudulently or dishonestly, or with intent to cause damage or injury to the public or to any person, cancels, destroys or defaces, or attempts to cancel, destroy or deface, or secretes or attempts to secrete any document which is or purports to be a will, or an authority to adopt a son, or any valuable security, or commits mischief in respect of such document, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "344. Falsification of accounts.",
        "s": "344. Whoever, being a clerk, officer or servant, or employed or acting in the capacity of a clerk, officer or servant, wilfully, and with intent to defraud, destroys, alters, mutilates or falsifies any book, electronic record, paper, writing, valuable security or account which belongs to or is in the possession of his employer, or has been received by him for or on behalf of his employer, or wilfully, and with intent to defraud, makes or abets the making of any false entry in, or omits or alters or abets the omission or alteration of any material particular from or in, any such book, electronic record, paper, writing, valuable security or account, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both. Explanation.—It shall be sufficient in any charge under this section to allege a general intent to defraud without naming any particular person intended to be defrauded or specifying any particular sum of money intended to be the subject of the fraud, or any particular day on which the offence was committed. Of property marks"
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "345. Property mark.",
        "s": "345. \n(1) A mark used for denoting that movable property belongs to a particular person is called a property mark.\n\n(2) Whoever marks any movable property or goods or any case, package or other receptacle containing movable property or goods, or uses any case, package or other receptacle having any mark thereon, in a manner reasonably calculated to cause it to be believed that the property or goods so marked, or any property or goods contained in any such receptacle so marked, belong to a person to whom they do not belong, is said to use a false property mark.\n\n(3) Whoever uses any false property mark shall, unless he proves that he acted without intent to defraud, be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "346. Tampering with a property mark with the intent to cause injury.",
        "s": "346. Whoever removes, destroys, defaces or adds to any property mark, intending or knowing it to be likely that he may thereby cause injury to any person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "347. Counterfeiting a property mark.",
        "s": "347. (1) Whoever counterfeits any property mark used by any other person shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n(2) Whoever counterfeits any property mark used by a public servant, or any mark used by a public servant to denote that any property has been manufactured by a particular person or at a particular time or place, or that the property is of a particular quality or has passed through a particular office, or that it is entitled to any exemption, or uses as genuine any such mark knowing the same to be counterfeit, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "348. Making or possession of any instrument for counterfeiting a property mark.",
        "s": "348. Whoever makes or has in his possession any die, plate or other instrument for the purpose of counterfeiting a property mark, or has in his possession a property mark for the purpose of denoting that any goods belong to a person to whom they do not belong, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "349. Selling goods marked with a counterfeit property mark.",
        "s": "349. Whoever sells, or exposes, or has in possession for sale, any goods or things with a counterfeit property mark affixed to or impressed upon the same or to or upon any case, package or other receptacle in which such goods are contained, shall, unless he proves—\n\n(a) that, having taken all reasonable precautions against committing an offence against this section, he had at the time of the commission of the alleged offence no reason to suspect the genuineness of the mark; and\n\n(b) that, on demand made by or on behalf of the prosecutor, he gave all the information in his power with respect to the persons from whom he obtained such goods or things; or\n\n(c) that otherwise he had acted innocently, be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO PROPERTY MARKS - Of property marks",
        "st": "350. Making a false mark upon any receptacle containing goods.",
        "s": "350. \n(1) Whoever makes any false mark upon any case, package or other receptacle containing goods, in a manner reasonably calculated to cause any public servant or any other person to believe that such receptacle contains goods which it does not contain or that it does not contain goods which it does contain, or that the goods contained in such receptacle are of a nature or quality different from the real nature or quality thereof, shall, unless he proves that he acted without intent to defraud, be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.\n\n(2) Whoever makes use of any false mark in any manner prohibited under sub-section (1) shall, unless he proves that he acted without intent to defraud, be punished as if he had committed the offence under sub-section (1)."
    }
]