[
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "206. Absconding to avoid service of summons or other proceeding.",
        "s": "206. Whoever absconds in order to avoid being served with a summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both;\n\n(b) where such summons or notice or order is to attend in person or by agent, or to produce a document or an electronic record in a Court shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "207. Preventing service of summons or other proceeding, or preventing publication thereof.",
        "s": "207. Whoever in any manner intentionally prevents the serving on himself, or on any other person, of any summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order, or intentionally prevents the lawful affixing to any place of any such summons, notice or order or intentionally removes any such summons, notice or order from any place to which it is lawfully affixed or intentionally prevents the lawful making of any proclamation, under the authority of any public servant legally competent, as such public servant, to direct such proclamation to be made,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both;\n\n(b) where the summons, notice, order or proclamation is to attend in person or by agent, or to produce a document or electronic record in a Court, with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "208. Non-attendance in obedience to an order from public servant.",
        "s": "208. Whoever, being legally bound to attend in person or by an agent at a certain place and time in obedience to a summons, notice, order, or proclamation proceeding from any public servant legally competent, as such public servant, to issue the same, intentionally omits to attend at that place or time or departs from the place where he is bound to attend before the time at which it is lawful for him to depart,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both;\n\n(b) where the summons, notice, order or proclamation is to attend in person or by agent in a Court with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.\n\nIllustrations.\n\n(a) A, being legally bound to appear before a High Court, in obedience to a subpoena issuing from that Court, intentionally omits to appear. A has committed the offence defined in this section.\n\n(b) A, being legally bound to appear before a District Judge, as a witness, in obedience to a summons issued by that District Judge intentionally omits to appear. A has committed the offence defined in this section."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "209. Non-appearance in response to a proclamation under section 84 of Bharatiya Nagarik Suraksha Sanhita, 2023.",
        "s": "209. Whoever fails to appear at the specified place and the specified time as required by a proclamation published under sub-section (1) of section 84 of the Bharatiya Nagarik Suraksha Sanhita, 2023, shall be punished with imprisonment for a term which may extend to three years, or with fine, or with both, or with community service, and where a declaration has been made under sub-section (4) of that section pronouncing him as a proclaimed offender, he shall be punished with imprisonment for a term which may extend to seven years and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "210. Omission to produce document or electronic record to public servant by a person legally bound to produce it.",
        "s": "210. Whoever, being legally bound to produce or deliver up any document or electronic record to any public servant, as such, intentionally omits so to produce or deliver up the same,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both;\n\n(b) and where the document or electronic record is to be produced or delivered up to a Court with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.\n\nIllustration.\nA, being legally bound to produce a document before a District Court, intentionally omits to produce the same. A has committed the offence defined in this section."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "211. Omission to give notice or information to public servant by a person legally bound to give it.",
        "s": "211. Whoever, being legally bound to give any notice or to furnish information on any subject to any public servant, as such, intentionally omits to give such notice or to furnish such information in the manner and at the time required by law,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both;\n\n(b) where the notice or information required to be given respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both;\n\n(c) where the notice or information required to be given is required by an order passed under section 394 of the Bharatiya Nagarik Suraksha Sanhita, 2023 with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "212. Furnishing false information.",
        "s": "212. Whoever, being legally bound to furnish information on any subject to any public servant, as such, furnishes, as true, information on the subject which he knows or has reason to believe to be false,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both;\n\n(b) where the information which he is legally bound to give respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\nIllustrations.\n (a) A, a landholder, knowing of the commission of a murder within the limits of his estate, wilfully misinforms the Magistrate of the district that the death has occurred by accident in consequence of the bite of a snake. A is guilty of the offence defined in this section.\n\n(b) A, a village watchman, knowing that a considerable body of strangers has passed through his village in order to commit a dacoity in the house of Z, a wealthy merchant residing in a neighbouring place, and being legally bound to give early and punctual information of the above fact to the officer of the nearest police station, wilfully misinforms the police officer that a body of suspicious characters passed through the village with a view to commit dacoity in a certain distant place in a different direction. Here A is guilty of the offence defined in this section.\n\nExplanation.—In section 211 and in this section the word “offence” include any act committed at any place out of India, which, if committed in India, would be punishable under any of the following sections, namely, 103, 105, 307, sub-sections (2), (3) and (4) of section 309, sub-sections (2), (3), (4) and (5) of section 310, 311, 312, clauses (f) and (g) of section 326, sub-sections (4), (6), (7) and (8) of section 331, clauses (a) and (b) of section 332 and the word “offender” includes any person who is alleged to have been guilty of any such act."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "213. Refusing oath or affirmation when duly required by public servant to make it.",
        "s": "213. Whoever refuses to bind himself by an oath or affirmation to state the truth, when required so to bind himself by a public servant legally competent to require that he shall so bind himself, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "214. Refusing to answer public servant authorized to question.",
        "s": "214. Whoever, being legally bound to state the truth on any subject to any public servant, refuses to answer any question demanded of him touching that subject by such public servant in the exercise of the legal powers of such public servant, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "215. Refusing to sign a statement.",
        "s": "215. Whoever refuses to sign any statement made by him, when required to sign that statement by a public servant legally competent to require that he shall sign that statement, shall be punished with simple imprisonment for a term which may extend to three months, or with fine which may extend to three thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "216. False statement on oath or affirmation to public servant or person authorized to administer an oath or affirmation.",
        "s": "216. Whoever, being legally bound by an oath or affirmation to state the truth on any subject to any public servant or other person authorised by law to administer such oath or affirmation, makes, to such public servant or other person as aforesaid, touching that subject, any statement which is false, and which he either knows or believes to be false or does not believe to be true, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "217. False information, with the intent to cause a public servant to use his lawful power to the injury of another person.",
        "s": "217. Whoever gives to any public servant any information which he knows or believes to be false, intending thereby to cause, or knowing it to be likely that he will thereby cause, such public servant—\n\n(a) to do or omit anything which such public servant ought not to do or omit if the true state of facts respecting which such information is given were known by him; or\n\n(b) to use the lawful power of such public servant to the injury or annoyance of any person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to ten thousand rupees, or with both.\n\nIllustrations.\n(a) A informs a Magistrate that Z, a police officer, subordinate to such Magistrate, has been guilty of neglect of duty or misconduct, knowing such information to be false, and knowing it to be likely that the information will cause the Magistrate to dismiss Z. A has committed the offence defined in this section.\n\n(b) A falsely informs a public servant that Z has contraband salt in a secret place, knowing such information to be false, and knowing that it is likely that the consequence of the information will be a search of Z’s premises, attended with annoyance to Z. A has committed the offence defined in this section.\n\n(c) A falsely informs a policeman that he has been assaulted and robbed in the neighbourhood of a particular village. He does not mention the name of any person as one of his assailants, but knows it to be likely that in consequence of this information the police will make enquiries and institute searches in the village to the annoyance of the villagers or some of them. A has committed an offence under this section."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "218. Resistance to taking of property by lawful authority of a public servant.",
        "s": "218. Whoever offers any resistance to the taking of any property by the lawful authority of any public servant, knowing or having reason to believe that he is such public servant, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "219. Obstructing sale of property offered for sale by the authority of public servant.",
        "s": "219. Whoever intentionally obstructs any sale of property offered for sale by the lawful authority of any public servant, as such, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "220. Illegal purchase or bid for property offered for sale by the authority of public servant.",
        "s": "220. Whoever, at any sale of property held by the lawful authority of a public servant, as such, purchases or bids for any property on account of any person, whether himself or any other, whom he knows to be under a legal incapacity to purchase that property at that sale, or bids for such property not intending to perform the obligations under which he lays himself by such bidding, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "221. Obstructing public servant in discharge of public functions.",
        "s": "221. Whoever voluntarily obstructs any public servant in the discharge of his public functions, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two thousand and five hundred rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "222. Omission to assist public servant when bound by law to give assistance.",
        "s": "222. Whoever, being bound by law to render or furnish assistance to any public servant in the execution of his public duty, intentionally omits to give such assistance,––\n\n(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to two thousand and five hundred rupees, or with both;\n\n(b) and where such assistance be demanded of him by a public servant legally competent to make such demand for the purposes of executing any process lawfully issued by a Court or of preventing the commission of an offence, or suppressing a riot, or affray, or of apprehending a person charged with or guilty of an offence, or of having escaped from lawful custody, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "223. Disobedience to order duly promulgated by public servant.",
        "s": "223. Whoever, knowing that, by an order promulgated by a public servant lawfully empowered to promulgate such order, he is directed to abstain from a certain act, or to take certain order with certain property in his possession or under his management, disobeys such direction,––\n\n(a) shall, if such disobedience causes or tends to cause obstruction, annoyance or injury, or risk of obstruction, annoyance or injury, to any person lawfully employed, be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to two thousand and five hundred rupees, or with both;\n\n(b) and where such disobedience causes or tends to cause danger to human life, health or safety, or causes or tends to cause a riot or affray, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to five thousand rupees, or with both.\n\nExplanation.—It is not necessary that the offender should intend to produce harm, or contemplate his disobedience as likely to produce harm. It is sufficient that he knows of the order which he disobeys, and that his disobedience produces, or is likely to produce, harm.\n\nIllustration.\nAn order is promulgated by a public servant lawfully empowered to promulgate such order, directing that a religious procession shall not pass down a certain street. A knowingly disobeys the order, and thereby causes danger of riot. A has committed the offence defined in this section."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "224. Threat of injury to public servant.",
        "s": "224. Whoever holds out any threat of injury to any public servant, or to any person in whom he believes that public servant to be interested, for the purpose of inducing that public servant to do any act, or to forbear or delay to do any act, connected with the exercise of the public functions of such public servant, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "225. Threat of injury to induce a person to refrain from applying for protection to public servant.",
        "s": "225. Whoever holds out any threat of injury to any person for the purpose of inducing that person to refrain or desist from making a legal application for protection against any injury to any public servant legally empowered as such to give such protection, or to cause such protection to be given, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIII - OF CONTEMPTS OF THE LAWFUL AUTHORITY OF PUBLIC SERVANTS",
        "st": "226. Attempt to commit suicide to compel or restrain the exercise of lawful power.",
        "s": "226. Whoever attempts to commit suicide with the intent to compel or restrain any public servant from discharging his official duty shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both, or with community service."
    }
]