[
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "198. Public servant disobeying law, with intent to cause injury to any person.",
        "s": "198. Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending to cause, or knowing it to be likely that he will by such disobedience, cause injury to any person, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both.\n\nIllustration. A, being an officer directed by law to take property in execution, in order to satisfy a decree pronounced in Z’s favour by a Court, knowingly disobeys that direction of law, with the knowledge that he is likely thereby to cause injury to Z. A has committed the offence defined in this section."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "199. Public servant disobeying direction under law.",
        "s": "199. Whoever, being a public servant,—\n(a) knowingly disobeys any direction of the law which prohibits him from requiring the attendance at any place of any person for the purpose of investigation into an offence or any other matter; or\n(b) knowingly disobeys, to the prejudice of any person, any other direction of the law regulating the manner in which he shall conduct such investigation; or\n(c) fails to record any information given to him under sub-section (1) of section 173 of the Bharatiya Nagarik Suraksha Sanhita, 2023 in relation to cognizable offence punishable under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 76, section 77, section 79, section 124, section 143 or section 144, shall be punished with rigorous imprisonment for a term which shall not be less than six months but which may extend to two years, and shall also be liable to fine."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "200. Punishment for non-treatment of victim.",
        "s": "200. Whoever, being in charge of a hospital, public or private, whether run by the Central Government, the State Government, local bodies or any other person, contravenes the provisions of section 397 of the Bharatiya Nagarik Suraksha Sanhita, 2023, shall be punished with imprisonment for a term which may extend to one year, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "201. Public servant framing an incorrect document with intent to cause injury.",
        "s": "201. Whoever, being a public servant, and being, as such public servant, charged with the preparation or translation of any document or electronic record, frames, prepares or translates that document or electronic record in a manner which he knows or believes to be incorrect, intending thereby to cause or knowing it to be likely that he may thereby cause injury to any person, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "202. Public servant unlawfully engaging in trade.",
        "s": "202. Whoever, being a public servant, and being legally bound as such public servant not to engage in trade, engages in trade, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both or with community service."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "203. Public servant unlawfully buying or bidding for property.",
        "s": "203. Whoever, being a public servant, and being legally bound as such public servant, not to purchase or bid for certain property, purchases or bids for that property, either in his own name or in the name of another, or jointly, or in shares with others, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both; and the property, if purchased, shall be confiscated."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "204. Personating a public servant.",
        "s": "204. Whoever pretends to hold any particular office as a public servant, knowing that he does not hold such office or falsely personates any other person holding such office, and in such assumed character does or attempts to do any act under colour of such office, shallbe punished with imprisonment of either description for a term which shall not be less than six months but which may extend to three years and with fine."
    },
    {
        "cn": "CHAPTER XII - OF OFFENCES BY OR RELATING TO PUBLIC SERVANTS",
        "st": "205. Wearing garb or carrying token used by public servant with fraudulent intent.",
        "s": "205. Whoever, not belonging to a certain class of public servants, wears any garb or carries any token resembling any garb or token used by that class of public servants, with   five thousand rupees, or with both."
    }
]