[
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "351. Criminal intimidation.",
        "s": "351. \n(1) Whoever threatens another by any means, with any injury to his person, reputation or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit to do any act which that person is legally entitled to do, as the means of avoiding the execution of such threat, commits criminal intimidation.\n\nExplanation.—A threat to injure the reputation of any deceased person in whom the person threatened is interested, is within this section.\n\nIllustration.\nA, for the purpose of inducing B to resist from prosecuting a civil suit, threatens to burn B’s house. A is guilty of criminal intimidation.\n\n(2) Whoever commits the offence of criminal intimidation shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n(3) Whoever commits the offence of criminal intimidation by threatening to cause death or grievous hurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or imprisonment for life, or with imprisonment for a term which may extend to seven years, or to impute unchastity to a woman, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.\n\n(4) Whoever commits the offence of criminal intimidation by an anonymous communication, or having taken precaution to conceal the name or abode of the person from whom the threat comes, shall be punished with imprisonment of either description for a term which may extend to two years, in addition to the punishment provided for the offence under sub-section (1)."
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "352. Intentional insult with intent to provoke a breach of peace.",
        "s": "352. Whoever intentionally insults in any manner, and thereby gives provocation to any person, intending or knowing it to be likely that such provocation will cause him to break the public peace, or to commit any other offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "353. Statements conducing to public mischief.",
        "s": "353. \n(1) Whoever makes, publishes or circulates any statement, false information, rumour, or report, including through electronic means—\n\n(a) with intent to cause, or which is likely to cause, any officer, soldier, sailor or airman in the Army, Navy or Air Force of India to mutiny or otherwise disregard or fail in his duty as such; or\n\n(b) with intent to cause, or which is likely to cause, fear or alarm to the public, or to any section of the public whereby any person may be induced to commit an offence against the State or against the public tranquility; or\n\n(c) with intent to incite, or which is likely to incite, any class or community of persons to commit any offence against any other class or community, shall be punished with imprisonment which may extend to three years, or with fine, or with both.\n\n(2) Whoever makes, publishes or circulates any statement or report containing false information, rumour or alarming news, including through electronic means, with intent to create or promote, or which is likely to create or promote, on grounds of religion, race, place of birth, residence, language, caste or community or any other ground whatsoever, feelings of enmity, hatred or ill will between different religious, racial, language or regional groups or castes or communities, shall be punished with imprisonment which may extend to three years, or with fine, or with both.\n\n(3) Whoever commits an offence specified in sub-section (2) in any place of worship or in any assembly engaged in the performance of religious worship or religious ceremonies, shall be punished with imprisonment which may extend to five years and shall also be liable to fine.\n\nException.—It does not amount to an offence, within the meaning of this section, when the person making, publishing or circulating any such statement, false information, rumour or report, has reasonable grounds for believing that such statement, false information, rumour or report is true and makes, publishes or circulates it in good faith and without any such intent as aforesaid."
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "354. Act caused by inducing a person to believe that he will be rendered an object of Divine displeasure.",
        "s": "354. Whoever voluntarily causes or attempts to cause any person to do anything which that person is not legally bound to do, or to omit to do anything which he is legally entitled to do, by inducing or attempting to induce that person to believe that he or any person in whom he is interested will become or will be rendered by some act of the offender an object of Divine displeasure if he does not do the thing which it is the object of the offender to cause him to do, or if he does the thing which it is the object of the offender to cause him to omit, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.\n\nIllustrations.\n(a) A sits dharna at Z’s door with the intention of causing it to be believed that, by so sitting, he renders Z an object of Divine displeasure. A has committed the offence defined in this section.\n\n(b) A threatens Z that, unless Z performs a certain act, A will kill one of A’s own children, under such circumstances that the killing would be believed to render Z an object of Divine displeasure. A has committed the offence defined in this section."
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "355. Misconduct in public by a drunken person.",
        "s": "355. Whoever, in a state of intoxication, appears in any public place, or in any place which it is a trespass in him to enter, and there conducts himself in such a manner as to cause annoyance to any person, shall be punished with simple imprisonment for a term which may extend to twenty-four hours, or with fine which may extend to one thousand rupees, or with both or with community service."
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "356. Defamation.",
        "s": "356. \n(1) Whoever, by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes in any manner, any imputation concerning any person intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person, is said, except in the cases hereinafter excepted, to defame that person.\n\nExplanation 1.—It may amount to defamation to impute anything to a deceased person, if the imputation would harm the reputation of that person if living, and is intended to be hurtful to the feelings of his family or other near relatives.\n\nExplanation 2.—It may amount to defamation to make an imputation concerning a company or an association or collection of persons as such.\n\nExplanation 3.—An imputation in the form of an alternative or expressed ironically, may amount to defamation.\n\nExplanation 4.—No imputation is said to harm a person’s reputation, unless that imputation directly or indirectly, in the estimation of others, lowers the moral or intellectual character of that person, or lowers the character of that person in respect of his caste or of his calling, or lowers the credit of that person, or causes it to be believed that the body of that person is in a loathsome state, or in a state generally considered as disgraceful.\n\nIllustrations.\n(a) A says— “Z is an honest man; he never stole B’s watch”; intending to cause it to be believed that Z did steal B’s watch. This is defamation, unless it falls within one of the exceptions.\n\n(b) A is asked who stole B’s watch. A points to Z, intending to cause it to be believed that Z stole B’s watch. This is defamation, unless it falls within one of the exceptions\n\n(c) A draws a picture of Z running away with B’s watch, intending it to be believed that Z stole B’s watch. This is defamation, unless it falls within one of the exceptions.\n\nException 1.—It is not defamation to impute anything which is true concerning any person, if it be for the public good that the imputation should be made or published. Whether or not it is for the public good is a question of fact.\n\nException 2.—It is not defamation to express in good faith any opinion whatever respecting the conduct of a public servant in the discharge of his public functions, or respecting his character, so far as his character appears in that conduct, and no further.\n\nException 3.—It is not defamation to express in good faith any opinion whatever respecting the conduct of any person touching any public question, and respecting his character, so far as his character appears in that conduct, and no further.\n\nIllustration.\nIt is not defamation in A to express in good faith any opinion whatever respecting Z’s conduct in petitioning Government on a public question, in signing a requisition for a meeting on a public question, in presiding or attending at such meeting, in forming or joining any society which invites the public support, in voting or canvassing for a particular candidate for any situation in the efficient discharge of the duties of which the public is interested.\n\nException 4.––It is not defamation to publish substantially true report of the proceedings of a Court, or of the result of any such proceedings.\n\nExplanation.—A Magistrate or other officer holding an inquiry in open Court preliminary to a trial in a Court, is a Court within the meaning of the above section.\n\nException 5.—It is not defamation to express in good faith any opinion whatever respecting the merits of any case, civil or criminal, which has been decided by a Court, or respecting the conduct of any person as a party, witness or agent, in any such case, or respecting the character of such person, as far as his character appears in that conduct, and no further.\n\nIllustrations.\n(a) A says—“I think Z’s evidence on that trial is so contradictory that he must be stupid or dishonest”. A is within this exception if he says this in good faith, in as much as the opinion which he expresses respects Z’s character as it appears in Z’s conduct as a witness, and no further.\n\n(b) But if A says—“I do not believe what Z asserted at that trial because I know him to be a man without veracity”; A is not within this exception, in as much as the opinion which    \n\nExplanation.—A performance may be submitted to the judgment of the public expressly or by acts on the part of the author which imply such submission to the judgment of the public.\n\nIllustrations.\n(a) A person who publishes a book, submits that book to the judgment of the public.\n(b) A person who makes a speech in public, submits that speech to the judgment of the public.\n(c) An actor or singer who appears on a public stage, submits his acting or singing to the judgment of the public.\n(d) A says of a book published by Z—“Z’s book is foolish; Z must be a weak man. Z’s book is indecent; Z must be a man of impure mind.” A is within the exception, if he says this in good faith, in as much as the opinion which he expresses of Z respects Z’s character only so far as it appears in Z’s book, and no further.\n(e) But if A says “I am not surprised that Z’s book is foolish and indecent, for he is a weak man and a libertine.” A is not within this exception, inasmuch as the opinion which he expresses of Z’s character is an opinion not founded on Z’s book.\n\nException 7.—It is not defamation in a person having over another any authority, either conferred by law or arising out of a lawful contract made with that other, to pass in good faith any censure on the conduct of that other in matters to which such lawful authority relates.\n\nIllustration.\nA Judge censuring in good faith the conduct of a witness, or of an officer of the Court; a head of a department censuring in good faith those who are under his orders, a parent censuring in good faith a child in the presence of other children; a schoolmaster, whose authority is derived from a parent, censuring in good faith a pupil in the presence of other pupils; a master censuring a servant in good faith for remissness in service; a banker censuring in good faith the cashier of his bank for the conduct of such cashier as such cashier are within this exception.\n\nException 8.—It is not defamation to prefer in good faith an accusation against any person to any of those who have lawful authority over that person with respect to the subject-matter of accusation.\n\nIllustration.\nIf A in good faith accuses Z before a Magistrate; if A in good faith complains of the conduct of Z, a servant, to Z’s master; if A in good faith complains of the conduct of Z, a child, to Z’s father-A is within this exception.\n\nException 9.— It is not defamation to make an imputation on the character of another provided that the imputation be made in good faith for the protection of the interests of the person making it, or of any other person, or for the public good.\n\nIllustrations.\n(a) A, a shopkeeper, says to B, who manages his business—“Sell nothing to Z unless he pays you ready money, for I have no opinion of his honesty.” A is within the exception, if he has made this imputation on Z in good faith for the protection of his own interests.\n(b) A, a Magistrate, in making a report to his own superior officer, casts an imputation on the character of Z. Here, if the imputation is made in good faith, and for the public good, A is within the exception.\n\nException 10.— It is not defamation to convey a caution, in good faith, to one person against another, provided that such caution be intended for the good of the person to whom it is conveyed, or of some person in whom that person is interested, or for the public good.\n\n(2) Whoever defames another shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both or with community service.\n\n(3) Whoever prints or engraves any matter, knowing or having good reason to believe that such matter is defamatory of any person, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both.\n\n(4) Whoever sells or offers for sale any printed or engraved substance containing defamatory matter, knowing that it contains such matter, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both. Of breach of contract to attend on and supply wants of helpless person"
    },
    {
        "cn": "CHAPTER XIX - OF CRIMINAL INTIMIDATION, INSULT, ANNOYANCE, DEFAMATION, ETC - Of defamation",
        "st": "357. Breach of contract to attend on and supply the wants of a helpless person.",
        "s": "357. Whoever, being bound by a lawful contract to attend on or to supply the wants of any person who, by reason of youth, or of unsoundness of mind, or of a disease or bodily weakness, is helpless or incapable of providing for his own safety or of supplying his own wants, voluntarily omits so to do, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five thousand rupees, or with both."
    }
]