[
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "270. Public nuisance.",
        "s": "270. A person is guilty of a public nuisance who does any act or is guilty of an illegal omission which causes any common injury, danger or annoyance to the public or to the people in general who dwell or occupy property in the vicinity, or which must necessarily cause injury, obstruction, danger or annoyance to persons who may have occasion to use any public right but a common nuisance is not excused on the ground that it causes some convenience or advantage"
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "271. Negligent act likely to spread infection of disease dangerous to life.",
        "s": "271. Whoever unlawfully or negligently does any act which is, and which he knows or has reason to believe to be, likely to spread the infection of any disease dangerous to life, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "272. Malignant act likely to spread infection of disease dangerous to life.",
        "s": "272. Whoever malignantly does any act which is, and which he knows or has reason to believe to be, likely to spread the infection of any disease dangerous to life, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "273. Disobedience to quarantine rule.",
        "s": "273. Whoever knowingly disobeys any rule made by the Government for putting any mode of transport into a state of quarantine, or for regulating the intercourse of any such transport in a state of quarantine or for regulating the intercourse between places where an infectious disease prevails and other places, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "274. Adulteration of food or drink intended for sale.",
        "s": "274. Whoever adulterates any article of food or drink, so as to make such article noxious as food or drink, intending to sell such article as food or drink, or knowing it to be likely that the same will be sold as food or drink, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "275. Sale of noxious food or drink.",
        "s": "275. Whoever sells, or offers or exposes for sale, as food or drink, any article which has been rendered or has become noxious, or is in a state unfit for food or drink, knowing or having reason to believe that the same is noxious as food or drink, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "276. Adulteration of drugs.",
        "s": "276. Whoever adulterates any drug or medical preparation in such a manner as to lessen the efficacy or change the operation of such drug or medical preparation, or to make it noxious, intending that it shall be sold or used for, or knowing it to be likely that it will be sold or used for, any medicinal purpose, as if it had not undergone such adulteration, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "277. Sale of adulterated drugs.",
        "s": "277. Whoever, knowing any drug or medical preparation to have been adulterated in such a manner as to lessen its efficacy, to change its operation, or to render it noxious, sells the same, or offers or exposes it for sale, or issues it from any dispensary for medicinal purposes as unadulterated, or causes it to be used for medicinal purposes by any person not knowing of the adulteration, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "278. Sale of a drug as a different drug or preparation.",
        "s": "278. Whoever knowingly sells, or offers or exposes for sale, or issues from a dispensary for medicinal purposes, any drug or medical preparation, as a different drug or medical preparation, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "279. Fouling water of public spring or reservoir.",
        "s": "279. Whoever voluntarily corrupts or fouls the water of any public spring or reservoir, so as to render it less fit for the purpose for which it is ordinarily used, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "280. Making the atmosphere noxious to health.",
        "s": "280. Whoever voluntarily vitiates the atmosphere in any place so as to make it noxious to the health of persons in general dwelling or carrying on business in the neighbourhood or passing along a public way, shall be punished with fine which may extend to one thousand rupees."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "281. Rash driving or riding on a public way.",
        "s": "281. Whoever drives any vehicle, or rides, on any public way in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any other person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "282. Rash navigation of a vessel.",
        "s": "282. Whoever navigates any vessel in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any other person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "283. Exhibition of a false light, mark, or buoy.",
        "s": "283. Whoever exhibits any false light, mark or buoy, intending or knowing it to be likely that such exhibition will mislead any navigator, shall be punished with imprisonment of either description for a term which may extend to seven years, and with fine which shall not be less than ten thousand rupees."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "284. Conveying a person by water for hire in an unsafe or overloaded vessel.",
        "s": "284. Whoever knowingly or negligently conveys, or causes to be conveyed for hire, any person by water in any vessel, when that vessel is in such a state or so loaded as to endanger the life of that person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "285. Danger or obstruction in a public way or line of navigation.",
        "s": "285. Whoever, by doing any act, or by omitting to take order with any property in his possession or under his charge, causes danger, obstruction or injury to any person in any public way or public line of navigation, shall be punished with fine which may extend to five thousand rupees."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "286. Negligent conduct with respect to a poisonous substance.",
        "s": "286. Whoever does, with any poisonous substance, any act in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any person or knowingly or negligently omits to take such order with any poisonous substance in his possession as is sufficient to guard against any probable danger to human life from such poisonous substance, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "287. Negligent conduct with respect to fire or combustible matter.",
        "s": "287. Whoever does, with fire or any combustible matter, any act so rashly or negligently as to endanger human life, or to be likely to cause hurt or injury to any other person or knowingly or negligently omits to take such order with any fire or any combustible matter in his possession as is sufficient to guard against any probable danger to human life from such fire or combustible matter, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to two thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "288. Negligent conduct with respect to an explosive substance.",
        "s": "288. Whoever does, with any explosive substance, any act so rashly or negligently as to endanger human life, or to be likely to cause hurt or injury to any other person, or knowingly or negligently omits to take such order with any explosive substance in his possession as is sufficient to guard against any probable danger to human life from that substance, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "289. Negligent conduct with respect to machinery.",
        "s": "289. Whoever does, with any machinery, any act so rashly or negligently as to endanger human life or to be likely to cause hurt or injury to any other person or knowingly or negligently omits to take such order with any machinery in his possession or under his care as is sufficient to guard against any probable danger to human life from such machinery, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "290. Negligent conduct with respect to pulling down, repairing, or constructing buildings, etc.",
        "s": "290. Whoever, in pulling down, repairing or constructing any building, knowingly or negligently omits to take such measures with that building as is sufficient to guard against any probable danger to human life from the fall of that building, or of any part thereof, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "291. Negligent conduct with respect to an animal.",
        "s": "291. Whoever knowingly or negligently omits to take such measures with any animal in his possession as is sufficient to guard against any probable danger to human life, or any probable danger of grievous hurt from such animal, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "292. Punishment for public nuisance in cases not otherwise provided for.",
        "s": "292. Whoever commits a public nuisance in any case not otherwise punishable by this Sanhita shall be punished with fine which may extend to one thousand rupees."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "293. Continuance of a nuisance after an injunction to discontinue.",
        "s": "293. Whoever repeats or continues a public nuisance, having been enjoined by any public servant who has lawful authority to issue such injunction not to repeat or continue such nuisance, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "294. Sale, etc., of obscene books, etc.",
        "s": "294. \n(1) For the purposes of sub-section (2), a book, pamphlet, paper, writing, drawing, painting, representation, figure or any other object, including display of any content in electronic form shall be deemed to be obscene if it is lascivious or appeals to the prurient interest or if its effect, or (where it comprises two or more distinct items) the effect of any one of its items, is, if taken as a whole, such as to tend to deprave and corrupt persons who are likely, having regard to all relevant circumstances, to read, see or hear the matter contained or embodied in it.\n\n(2) Whoever—\n(a) sells, lets to hire, distributes, publicly exhibits or in any manner puts into circulation, or for purposes of sale, hire, distribution, public exhibition or circulation, makes, produces or has in his possession any obscene book, pamphlet, paper, drawing, painting, representation or figure or any other obscene object whatsoever in whatever manner; or\n\n(b) imports, exports or conveys any obscene object for any of the purposes aforesaid, or knowing or having reason to believe that such object will be sold, let to hire, distributed or publicly exhibited or in any manner put into circulation; or\n\n(c) takes part in or receives profits from any business in the course of which he knows or has reason to believe that any such obscene objects are, for any of the purposes aforesaid, made produced, purchased, kept, imported, exported, conveyed, publicly exhibited or in any manner put into circulation; or\n\n(d) advertises or makes known by any means whatsoever that any person is engaged or is ready to engage in any act which is an offence under this section, or that any such obscene object can be procured from or through any person; or\n\n(e) offers or attempts to do any act which is an offence under this section, shall be punished on first conviction with imprisonment of either description for a term which may extend to two years, and with fine which may extend to five thousand rupees, and, in the event of a second or subsequent conviction, with imprisonment of either description for a term which may extend to five years, and also with fine which may extend to ten thousand rupees.\n\nException.—This section does not extend to—\n(a) any book, pamphlet, paper, writing, drawing, painting, representation or figure—\n(i) the publication of which is proved to be justified as being for the public good on the ground that such book, pamphlet, paper, writing, drawing, painting, representation or figure is in the interest of science, literature, art or learning or other objects of general concern; or\n(ii) which is kept or used bona fide for religious purposes;\n\n(b) any representation sculptured, engraved, painted or otherwise represented on or in—\n(i) any ancient monument within the meaning of the Ancient Monuments and Archaeological Sites and Remains Act, 1958; or\n(ii) any temple, or on any car used for the conveyance of idols, or kept or used for any religious purpose."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "295. Sale, etc., of obscene objects to a child.",
        "s": "295. Whoever sells, lets to hire, distributes, exhibits or circulates to any child any such obscene object as is referred to in section 294, or offers or attempts so to do, shall be punished on first conviction with imprisonment of either description for a term which may extend to three years, and with fine which may extend to two thousand rupees, and, in the event of a second or subsequent conviction, with imprisonment of either description for a term which may extend to seven years, and also with fine which may extend to five thousand rupees."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "296. Obscene acts and songs.",
        "s": "296. Whoever, to the annoyance of others,—\n\n(a) does any obscene act in any public place; or\n\n(b) sings, recites or utters any obscene song, ballad or words, in or near any public place, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to one thousand rupees, or with both."
    },
    {
        "cn": "CHAPTER XV - OF OFFENCES AFFECTING THE PUBLIC HEALTH, SAFETY, CONVENIENCE, - DECENCY AND MORALS",
        "st": "297. Keeping a lottery office.",
        "s": "297.\n(1) Whoever keeps any office or place for the purpose of drawing any lottery not being a State lottery or a lottery authorised by the State Government, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\n(2) Whoever publishes any proposal to pay any sum, or to deliver any goods, or to do or forbear from doing anything for the benefit of any person, on any event or contingency relative or applicable to the drawing of any ticket, lot, number or figure in any such lottery, shall be punished with fine which may extend to five thousand rupees."
    }
]